# utf-8

# Задача - 1
# Запросите у пользователя имя, фамилию, email. Теперь необходимо совершить проверки, имя и фамилия должны иметь
# заглавные первые буквы.
# email - не должен иметь заглавных букв и должен быть в формате: текст в нижнем регистре, допускается нижнее
# подчеркивание и цифры, потом @, потом текст, допускаются цифры, точка, ru или org или com.
# Например:
# Пупкин василий - неверно указано имя, te$T@test.net - неверно указан email (спецсимвол, заглавная буква, .net),
# te_4_st@test.com - верно указан.

import re

def check_data(pattern, data, message):
    result = re.search(pattern, data)
    if result:
        print(data)
    else:
        print('Неверно: ', message)


name = input('Ваше имя: ')
surname = input('Ваша фамилия: ')
email = input('Ваш e-mail: ')

pattern_name_surname = '^([А-ЯЁ]{1}[а-яё]+)|([A-Z]{1}[a-z]+)$'
pattern_email = '^([a-z_0-9]+)@[a-z0-9]+\.(ru|org|com)$'

check_data(pattern_name_surname, name, 'имя')
check_data(pattern_name_surname, surname, 'фамилия')
check_data(pattern_email, email, 'e-mail')

# Задача - 2:
# Вам дан текст:

some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.'''

# Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
# более одной точки, при любом исходе сообщите результат пользователю!

pattern_dots = '[\.]{2,}'

result = re.findall(pattern_dots, some_str)

if result:
    print(result)
else:
    print('Ничего не найдено!')