# utf-8

## Уровень Easy

# Задача-1

name = input('Как вас зовут?')
message = 'Привет, '

print(message, name)

# Задача-2

number = int(input('Назовите любое число: '))
print('Ваш результат: ', number + 2)

# Задача-3

age = input('Назовите ваш возраст: ')

if int(age) >= 18:
    print('Доступ разрешен')
else:
    print('Извините, пользование данным ресурсом только с 18 лет')


